{
  "backend/main.mo": "Main actor implementing user profiles with legal acceptance fields (termsAccepted, privacyPolicyAccepted), artist management, platform commission settings, blob storage, and access control with role-based permissions.",
  "backend/migration.mo": "Migration module that transforms old UserProfile records (without legal fields) to new UserProfile records by adding termsAccepted and privacyPolicyAccepted fields defaulted to false.",
  "feature_evidence.json": "Feature evidence report documenting implementation of Terms and Conditions page, Privacy Policy page, footer links in Layout, and required acceptance checkboxes in ProfileSetupModal and ArtistRegistration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, layout with legal footer links, profile setup modal with legal checkboxes, artist registration with legal acceptance, and various dashboard and marketplace pages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Artisan Hub Marketplace', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with all routes (including /terms and /privacy-policy), QueryClient, ThemeProvider, and Toaster for notifications.",
  "frontend/src/components/AdminNav.tsx": "Admin navigation component with links to Dashboard, Users, and Revenue pages, each with icons and responsive text visibility.",
  "frontend/src/components/AdminStripeAccountSetup.tsx": "React component for admin to configure platform Stripe account ID for receiving commission payments. Includes validation, status display, and save functionality.",
  "frontend/src/components/ArtistBenefits.tsx": "Displays a grid of four benefit cards (Global Exposure, Secure Payments, Easy Management, Fair Compensation) for artists joining the marketplace.",
  "frontend/src/components/ArtistListItem.tsx": "Card component displaying individual artist profile with avatar, status badge, and activate/deactivate toggle button for admin management.",
  "frontend/src/components/BulkImageUpload.tsx": "Allows artists to upload multiple images at once, creating a product listing for each image with progress tracking and error handling.",
  "frontend/src/components/BuyNowButton.tsx": "Product purchase button that validates payment configuration (artist and admin Stripe accounts) before initiating Stripe checkout session.",
  "frontend/src/components/CommissionSettings.tsx": "Admin form to view and update the platform commission rate percentage (0-100%) applied to artist sales.",
  "frontend/src/components/DonationCard.tsx": "Card component for donation products with suggested and custom amount options, payment configuration validation, and Stripe checkout integration.",
  "frontend/src/components/DonationForm.tsx": "A dialog form component for artists to create donation options with title, description, suggested amount, and category fields. Submits donation products via the useAddProduct hook.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header navigation, authentication state, mobile menu, and footer with social links. Conditionally renders admin/user navigation and profile setup modal based on authentication and role.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/PaymentMethodSetup.tsx": "Card component for configuring payment methods (Stripe API key or Stripe Connect). Displays current payment status with badges and allows saving/removing API keys.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image carousel, video support, and buy button. Shows payment configuration status and includes navigation controls for multiple product images.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup requiring name, email, optional bio, and acceptance of terms and privacy policy. Non-dismissible until profile is created.",
  "frontend/src/components/StoreSettingsForm.tsx": "React form component for managing store settings including store name, bio, banner image upload with progress tracking, and social media links (Instagram, Facebook, Twitter, YouTube, TikTok). Uses react-hook-form for validation and custom hooks for fetching and updating store settings.",
  "frontend/src/components/StripeSetup.tsx": "Component for configuring Stripe payment integration, allowing users to input their Stripe secret key and allowed country codes. Displays configuration status and provides update functionality with loading states and toast notifications.",
  "frontend/src/components/UserNav.tsx": "Navigation component displaying links to the artist dashboard (\"My Studio\") and artist registration page (\"Become Artist\") with icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook for creating Stripe checkout sessions with shopping cart items, generating success and cancel URLs based on current window location.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor, with loading state management tied to actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle with configurable options for idle handling and delegation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, artist registration/management, product CRUD, store settings, Stripe configuration, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system for light and dark themes, including colors for backgrounds, foregrounds, borders, charts, and sidebar components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for managing marketplace settings including Stripe configuration, commission rates, admin Stripe account setup, and product management with delete functionality.",
  "frontend/src/pages/ArtistDashboard.tsx": "Artist dashboard page with tabs for managing products and donations, including product CRUD operations, media upload (images/video), store settings, payment method setup, and bulk image upload functionality.",
  "frontend/src/pages/ArtistRegistration.tsx": "Artist registration page with form for name, email, and acceptance of terms/privacy policy, displaying artist benefits and redirecting to dashboard upon successful registration.",
  "frontend/src/pages/ArtistStorePage.tsx": "Public-facing artist store page displaying artist profile, banner, bio, social links, and tabs for browsing their products and donations.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with a red X icon and a button to return to the marketplace.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page displaying a confirmation message with a green checkmark icon and a button to continue shopping.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Privacy policy page displaying legal information about data collection, usage, cookies, and user rights in a scrollable area.",
  "frontend/src/pages/ProductListing.tsx": "Main marketplace page that displays products and donation options in tabbed views, fetching all products via useGetAllProducts hook and rendering them with ProductCard or DonationCard components. Includes a hero banner and handles loading/error states.",
  "frontend/src/pages/RevenueAnalytics.tsx": "Admin-only page that displays revenue metrics including total revenue, admin commission (10%), artist earnings (90%), and transaction count using placeholder data. Redirects non-admin users to the products page.",
  "frontend/src/pages/TermsAndConditions.tsx": "Static page displaying the platform's terms and conditions in a scrollable area, covering user responsibilities, intellectual property rights, payment terms, and artist obligations.",
  "frontend/src/pages/UserManagement.tsx": "Admin-only page for managing artist accounts, displaying a list of artists with their profiles and active status, and providing delete functionality with confirmation dialog. Redirects non-admin users to the products page.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, extended theme properties including animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for Artisan Hub Marketplace, an online platform for creatives to sell original work with Stripe Connect integration, 90/10 revenue split, and admin dashboard. Tracks 17 implemented features including artist onboarding, product listings with multi-media support, checkout flows, payment processing, and admin management tools."
}