{
  "backend/main.mo": "Main backend actor implementing user profiles with Stripe API keys, artist management, product/donation listings, Stripe checkout integration, admin Stripe account configuration, split payment processing, and payment setup validation with authorization and blob storage mixins.",
  "backend/migration.mo": "Data migration module that transforms old UserProfile records (name, email, bio) to new format by adding a nullable stripeApiKey field.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: artist payment configuration UI, admin Stripe account setup, split payment processing integration, and payment validation in checkout flow.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components, pages, and hooks describing the marketplace UI including product listings, admin/artist dashboards, payment configuration, Stripe integration, and authorization flows.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including primary, secondary, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Artisan Hub Marketplace application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router with routes for marketplace, admin, artist, and payment pages, plus QueryClient, ThemeProvider, and Toaster setup.",
  "frontend/src/components/AdminNav.tsx": "Navigation component rendering admin-specific links to dashboard, user management, and revenue analytics with icons.",
  "frontend/src/components/AdminStripeAccountSetup.tsx": "Card component for admin to configure platform Stripe account ID with validation, status badge, and warning when not configured to receive commission payments.",
  "frontend/src/components/ArtistBenefits.tsx": "Displays a grid of four benefit cards (Global Exposure, Secure Payments, Easy Management, Fair Compensation) for artists using icons and descriptions.",
  "frontend/src/components/ArtistListItem.tsx": "Renders a card for an individual artist profile with avatar, name, email, Stripe status, and an activate/deactivate toggle button.",
  "frontend/src/components/BulkImageUpload.tsx": "Provides a UI for uploading multiple images at once, creating a product for each image with progress tracking and error handling.",
  "frontend/src/components/BuyNowButton.tsx": "A button component that initiates Stripe checkout for a product, validating that both artist and admin payment configurations are complete before proceeding.",
  "frontend/src/components/CommissionSettings.tsx": "Admin form to view and update the platform commission rate percentage, showing how much artists receive after commission.",
  "frontend/src/components/DonationCard.tsx": "Displays a donation product card with suggested amount, custom amount input dialog, and payment configuration validation before processing donations.",
  "frontend/src/components/DonationForm.tsx": "Dialog form for artists to create donation options with title, description, suggested amount, and category fields.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header navigation, mobile menu, footer with social links, and profile setup modal. Conditionally renders admin and user navigation based on authentication and role.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and error handling. Clears query cache on logout.",
  "frontend/src/components/PaymentMethodSetup.tsx": "Payment configuration interface allowing artists to set up Stripe API keys or Stripe Connect. Displays current payment status with badges and provides forms for managing payment methods.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image carousel, video support, category badge, and buy button. Shows payment configuration status and includes navigation controls for multiple images.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation requiring name and email with optional bio field. Non-dismissible until profile is created.",
  "frontend/src/components/StoreSettingsForm.tsx": "Form component for managing artist store settings including store name, bio, banner image upload with progress tracking, and social media links. Uses react-hook-form for validation and state management.",
  "frontend/src/components/StripeSetup.tsx": "React component for configuring Stripe payment settings, allowing admins to input secret key and allowed countries, with form validation and status display.",
  "frontend/src/components/UserNav.tsx": "Navigation component displaying links to artist dashboard and artist registration with icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, initializing it with Internet Identity and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that creates a Stripe checkout session by calling the backend actor with shopping items and success/cancel URLs.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity delegation, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on user profiles, artists, products, Stripe configuration, store settings, and shopping cart functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with role-based access control, displaying Stripe configuration, commission settings, and admin Stripe account setup components.",
  "frontend/src/pages/ArtistDashboard.tsx": "Artist dashboard page for managing products, donations, store settings, and payment methods with media upload functionality for images and videos.",
  "frontend/src/pages/ArtistRegistration.tsx": "Artist registration form page that collects name and email to register a new artist profile, with benefits display and authentication check.",
  "frontend/src/pages/ArtistStorePage.tsx": "Public-facing artist store page displaying banner, bio, social links, and tabbed product/donation listings filtered by artist ID.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure confirmation page with error message and navigation back to marketplace.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page with thank you message and continue shopping button.",
  "frontend/src/pages/ProductListing.tsx": "Main marketplace page with hero banner and tabbed view of all products and donation options across all artists.",
  "frontend/src/pages/RevenueAnalytics.tsx": "Admin-only revenue analytics dashboard showing total revenue, commission breakdown, artist earnings, and transaction metrics with role-based access control.",
  "frontend/src/pages/UserManagement.tsx": "Admin-only page that displays a list of all registered artists with their status, using role-based access control to redirect non-admin users to the products page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and state tracking for Artisan Hub Marketplace, documenting architectural decisions (Stripe Connect, 90/10 revenue split), existing features, and implementation priorities for the creative marketplace platform."
}