{
  "backend/main.mo": "Main actor implementing user profiles, artist management with Stripe integration, product/donation CRUD with ProductType enum, platform commission settings, and includes authorization and blob storage mixins with migration support.",
  "backend/migration.mo": "Migration module that transforms OldActor to NewActor by adding productType field to products (defaulting to #product), renaming configuration to stripeConfiguration, and initializing checkoutSessions map.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: bulk image upload, donation creation flow, marketplace filtering, store settings interface, and public artist store page with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend TypeScript/TSX files describing routing, components, pages, hooks, and their key functionality including artist dashboard, product management, Stripe integration, and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Artisan Hub Marketplace', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 11 routes (home, products, admin pages, artist pages, payment pages, store page), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/AdminNav.tsx": "Navigation component rendering three admin links (Dashboard, Users, Revenue) with icons that hide text on smaller screens.",
  "frontend/src/components/ArtistBenefits.tsx": "Grid component displaying four benefit cards (Global Exposure, Secure Payments, Easy Management, Fair Artist Compensation) with icons and descriptions, avoiding specific revenue percentage mentions.",
  "frontend/src/components/ArtistListItem.tsx": "Displays an artist profile card with avatar, name, email, active status badge, and Stripe connection indicator. Includes a button to toggle artist activation/deactivation status with loading states and toast notifications.",
  "frontend/src/components/BulkImageUpload.tsx": "Provides bulk image upload functionality for artists, allowing multiple image files to be selected, uploaded with progress tracking, and automatically converted into products. Displays upload status (pending/uploading/success/error) for each file with visual feedback.",
  "frontend/src/components/BuyNowButton.tsx": "Renders a \"Buy Now\" button that creates a Stripe checkout session for a single product and redirects the user to the Stripe payment page. Shows loading state during checkout session creation.",
  "frontend/src/components/CommissionSettings.tsx": "Admin component for viewing and updating the platform commission rate (0-100%). Displays current rate, calculates artist earnings percentage, and includes validation with toast notifications for success/error states.",
  "frontend/src/components/DonationCard.tsx": "Displays a donation product card with suggested amount, artist info, and category badge. Provides buttons for donating the suggested amount or opening a dialog to enter a custom donation amount, then creates a Stripe checkout session.",
  "frontend/src/components/DonationForm.tsx": "Dialog form for artists to create donation options with title, description, suggested amount, and category fields. Validates input and creates a donation-type product with form reset on success.",
  "frontend/src/components/Layout.tsx": "Main application layout wrapper providing header with navigation, authentication state, mobile menu, profile setup modal, and footer with social links. Conditionally renders admin/user navigation based on role and displays marketplace link.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators and error handling for duplicate authentication.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with name, description, price, category badge, artist link, and a buy button in a responsive card layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for new users to create their profile with required name and email fields plus an optional bio field, preventing dismissal until completed.",
  "frontend/src/components/StoreSettingsForm.tsx": "A form component for artists to customize their store settings including name, bio, banner image upload with progress tracking, and social media links for multiple platforms.",
  "frontend/src/components/StripeSetup.tsx": "Manages Stripe payment configuration by allowing users to input their secret key and allowed countries, displaying configuration status with options to update settings.",
  "frontend/src/components/UserNav.tsx": "Navigation component with links to the artist dashboard and artist registration page, using icons and responsive text labels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "A mutation hook that creates a Stripe checkout session for shopping cart items, generating success and cancel URLs based on the current window location.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile from the backend actor, coordinating loading states with actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, artist management, products, Stripe configuration, store settings, and social links with mutations and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, defining design tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page that displays Stripe payment configuration and commission settings, with role-based access control redirecting non-admins.",
  "frontend/src/pages/ArtistDashboard.tsx": "Artist dashboard with tabs for managing products and donations, including CRUD operations, bulk image upload, store settings, and commission rate display.",
  "frontend/src/pages/ArtistRegistration.tsx": "Artist registration form page that collects name and email, displays artist benefits, and redirects to dashboard upon successful registration.",
  "frontend/src/pages/ArtistStorePage.tsx": "Public-facing artist store page displaying banner, bio, social links, and tabbed product/donation listings filtered by artist ID.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with a link back to the marketplace after unsuccessful payment processing.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page displaying a green checkmark icon, thank you message, and a button to continue shopping.",
  "frontend/src/pages/ProductListing.tsx": "Main marketplace page with hero banner and tabbed interface displaying products and donation options in a responsive grid layout.",
  "frontend/src/pages/RevenueAnalytics.tsx": "Admin-only revenue analytics dashboard showing total revenue, admin commission (10%), artist earnings (90%), and transaction count with placeholder data.",
  "frontend/src/pages/UserManagement.tsx": "Admin-only user management page displaying a list of registered artists with their status and management controls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, container queries, typography, and animation plugins.",
  "project_state.json": "Project metadata defining Artisan Hub Marketplace architecture with Stripe Connect integration, 90/10 revenue split, multi-photo uploads, AI descriptions, and implemented features tracking."
}